Repository: logolang/logo-playground
Catalog: content/strings.*.po
Languages: ru

# about.aboutTitle
source: About
ru: Информация

# cheatSheet.cheatSheetTitle
source: Cheat sheet
ru: Шпаргалка

# common.appTitle
source: Logo playground
ru: Лого

# common.areYouSure
source: Are you sure?
ru: Вы уверены?

# common.cancel
source: Cancel
ru: Отменить

# common.continue
source: Continue
ru: Продолжить

# common.copied
source: Copied
ru: Скопировано

# common.copyToClipboard
source: Copy to clipboard
ru: Скопировать в буфер обмена

# common.delete
source: Delete
ru: Удалить

# common.error
source: Sorry, error has occured
ru: Произошла ошибка

# common.save
source: Save
ru: Сохранить

# common.signIn
source: Sign in
ru: Войти

# common.signInWithGoogle
source: Sign in with Google
ru: Войти с помощью Google

# common.signOut
source: Sign out
ru: Выйти

# gallery.addedProgramsMessage
source: Added one program
ru: Добавлена %d программа.

# gallery.chooseAFile
source: Choose a file…
ru: Выбрать файл…

# gallery.emptyLibrary
source: You do not have any programs stored in personal library yet.
ru: В вашей персональной библиотеке пока нет программ.

# gallery.export
source: Export
ru: Экспорт

# gallery.galleryImage
source: Gallery image
ru: Картина в галерею

# gallery.galleryTitle
source: Gallery
ru: Галерея

# gallery.import
source: Import
ru: Импорт

# gallery.importCompletedTitle
source: Import completed
ru: Импорт завершен успешно

# gallery.importModalTitle
source: Import programs to library
ru: Импорт программ в библиотеку

# gallery.notLoggedInGalleryMessage
source: As you are not signed in, your library is stored in browser's local storage. Please sign in if you want to synchronize your library.
ru: Для синхронизации персональной библиотеки необходимо войти в свой аккаунт.

# gallery.wrongFileFormatForImport
source: Looks like import file is corrupted or this format is not supported.
ru: Данный формат файла не поддерживается.

# login.notLoggedInSignInMessage
source: Signing in allows to save your program library to your account. So you can synchronize your library across multiple devices and access your data from everywhere.
ru: Вход в систему позволяет сохранить библиотеку программ в вашей учетной записи. Таким образом, вы можете синхронизировать свою библиотеку на нескольких устройствах и получать доступ к своим данным из любого места.

# login.title
source: Sign in
ru: Войти

# program.codePanelTitle
source: Program box
ru: Программа

# program.formatDocument
source: Format code
ru: Выровнять код

# program.imagePreview
source: Image preview
ru: Скриншот

# program.imageUrl
source: Image url
ru: Публичная ссылка

# program.outputPanelTitle
source: Drawing box
ru: Графика

# program.playgroundTitle
source: Playground
ru: Песочница

# program.pleaseEnterNameForYourProgram
source: Please enter the name for your program
ru: Введите название своей программы

# program.program
source: Program
ru: Программа

# program.programHasChanges
source: This program has changes
ru: У вас есть изменения в программе.

# program.programName
source: Program name
ru: Название программы

# program.publicUrl
source: Public url
ru: Публичная ссылка

# program.revertChanges
source: Revert changes
ru: Отменить изменения

# program.run
source: Run
ru: Запуск

# program.runDescription
source: Execute the program
ru: Запустить программу

# program.save
source: Save
ru: Сохранить

# program.saveAs
source: Save as...
ru: Сохранить как ...

# program.saveToLibraryModalTitle
source: Save to personal library
ru: Сохранить

# program.screenshotModalTitle
source: Screenshot
ru: Скриншот

# program.share
source: Share
ru: Опубликовать

# program.shareYourProgramModalTitle
source: Share your program
ru: Опубликовать

# program.stop
source: Stop
ru: Стоп

# program.stopDescription
source: Stop execution of the program
ru: Остановить выполнение программы

# program.takeScreenshot
source: Take screenshot
ru: Сделать скриншот

# program.youAreGoingToDeleteProgram
source: You are going to delete this program.
ru: Вы собираетесь удалить эту программу.

# settings.language
source: Language
ru: Язык

# settings.settingsTitle
source: Settings
ru: Настройки

# settings.turtleSize
source: Turtle size
ru: Размер черепахи

# settings.turtleSizes.extraSmall
source: Extra small
ru: Очень маленький

# settings.turtleSizes.huge
source: Huge
ru: Огромный

# settings.turtleSizes.large
source: Large
ru: Крупный

# settings.turtleSizes.medium
source: Medium
ru: Средний

# settings.turtleSizes.small
source: Small
ru: Маленький

# settings.turtleSkin
source: Turtle outfit
ru: Вид черепахи

# settings.turtleSkins.bob
source: Chilly Bob
ru: Весёлый Боб

# settings.turtleSkins.bright_runner
source: Bright Runner
ru: Мистер

# settings.turtleSkins.chameleon
source: Chameleon
ru: Хамелеон

# settings.turtleSkins.diver
source: Deep Diver
ru: Ныряльщик

# settings.turtleSkins.princess
source: Princess
ru: Принцесса

# settings.turtleSkins.summer
source: Summer
ru: Жорик

# settings.uiTheme
source: User interface theme
ru: Тема пользовательского интерфейса

# tutorial.back
source: Back
ru: Назад

# tutorial.chooseAnotherTutorial
source: Choose another tutorial
ru: Выбрать другой раздел

# tutorial.chooseTutorial
source: Choose a tutorial
ru: Выберите раздел

# tutorial.fixTheCodeMessage
source: If your code isn't working as the tutorial describes, you can replace it with a working version.
ru: Если ваш код не работает, как описано в учебнике, вы можете заменить его рабочей версией.

# tutorial.fixTheCodeTitle
source: Fix the code?
ru: Исправить код?

# tutorial.fixTheCodeWarning
source: This will overwrite your code entirely.
ru: Это полностью перезапишет ваш код.

# tutorial.helpItsNotworking
source: Help – it's not working!
ru: Помогите - не работает!

# tutorial.noLeaveItAsIs
source: No, leave it as is
ru: Отменить

# tutorial.start
source: Start
ru: Вперед

# tutorial.stepIndicator
source: Step %1$s of %2$s
ru: Шаг %1$s из %2$s

# tutorial.tutorialPanelTitle
source: Tutorial
ru: Урок

# tutorial.tutorialsTitle
source: Tutorials
ru: Учебники

# tutorial.yesFixMyCode
source: Yes, fix my code
ru: Да, исправить

# welcome.galleryLinkDescription
source: The gallery provides lots of examples of different levels of complexity. Gain inspiration and unleash power of your creativity.
ru: Галерея предоставляет множество примеров разных уровней сложности. Получите вдохновение и раскройте силу своего творчества.

# welcome.galleryLinkHeader
source: Explore the gallery
ru: Галерея

# welcome.playgroundLinkDescription
source: This is a coding area where you can write and run your LOGO programs interactively.
ru: Здесь вы можете писать и запускать свои программы LOGO в интерактивном режиме.

# welcome.playgroundLinkHeader
source: Playground for coding
ru: Песочница

# welcome.title
source: Welcome
ru: Добро пожаловать!

# welcome.tutorialsLinkDescription
source: Tutorials are the best way to learn fast and have fun. If you are new to LOGO programming this section is for you.
ru: Учебники - лучший способ быстро и весело учиться. Если вы новичок в программировании LOGO, этот раздел для вас.

# welcome.tutorialsLinkHeader
source: Learn the basics with tutorials
ru: Учебники
